[{
  "_id": 1,
  "movieName": "Titanic",
  "duration": "1:30:29",
  "thumbnail": "assets/HC_Images/Titanic_(1997_film)_poster.png",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/CHekzSiZjrY",
  "rating": 5.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "description": "RMS Titanic was a British passenger liner, operated by the White Star Line, which sank in the North Atlantic Ocean on 15 April 1912 after striking an iceberg during her maiden voyage from Southampton, UK, to New York City, United States. Of the estimated 2,224 passengers and crew aboard, more than 1,500 died, making it the deadliest sinking of a single ship up to that time. It remains the deadliest peacetime sinking of a superliner or cruise ship. The disaster drew public attention, provided foundational material for the disaster film genre, and has inspired many artistic works.",
  "tmdbId": 597
},{
  "_id": 2,
  "movieName": "Three Idiots",
  "duration": "2:15:45",
  "thumbnail": "assets/HC_Images/3_Idiots.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/K0eDlFX9GMc",
  "rating": 7.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "description": "3 Idiots is a 2009 Indian Hindi-language coming-of-age comedy-drama film written and directed by Rajkumar Hirani co-written by Abhijat Joshi, with producer Vidhu Vinod Chopra acting as a screenplay associate. Adapted loosely from Chetan Bhagat's novel Five Point Someone, the film stars Aamir Khan, R. Madhavan and Sharman Joshi in the titular roles, marking their reunion 3 years after Rang De Basanti (2006), while Kareena Kapoor, Boman Irani and Omi Vaidya star in pivotal roles. Narrated through parallel dramas, one in the present and the other ten years in the past, the story follows the friendship of three students at an Indian engineering college and is a satire about the social pressures under an Indian education system.",
  "tmdbId": 20453
},{
  "_id": 3,
  "movieName": "RedDead Redemption 2",
  "duration": "1:45:30",
  "thumbnail": "assets/HC_Images/Red_Redemption_2.jpg",
  "genre": "adventure",
  "sourceUrl": "https://www.youtube.com/embed/eaW0tYpxyp0",
  "rating": 7.7,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. The game is the third entry in the Red Dead series and a prequel to the 2010 game Red Dead Redemption. The story is set in 1899 and follows the exploits of outlaw Arthur Morgan, a member of the Van der Linde gang, in a fictionalized representation of the Western, Midwestern, and Southern United States. Arthur must deal with the decline of the Wild West whilst attempting to survive against government forces, rival gangs, and other adversaries. The game's epilogue follows fellow gang member John Marston, the protagonist of Red Dead Redemption.",
  "tmdbId": 13989
},{
  "_id": 4,
  "movieName": "Avengers",
  "duration": "1:50:45",
  "thumbnail": "assets/HC_Images/Avengers.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/eOrNdBpGMv8",
  "description": "Marvel's The Avengers (classified under the name Marvel Avengers Assemble in the United Kingdom and Ireland), or simply The Avengers, is a 2012 American superhero film based on the Marvel Comics superhero team of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the sixth film in the Marvel Cinematic Universe (MCU). Written and directed by Joss Whedon, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, and Jeremy Renner as the Avengers, alongside Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, and Samuel L. Jackson. In the film, Nick Fury and the spy agency S.H.I.E.L.D. recruit Tony Stark, Steve Rogers, Bruce Banner, Thor, Natasha Romanoff, and Clint Barton to form a team capable of stopping Thor's brother Loki from subjugating Earth.",
  "rating": 6.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 24428
},{
  "_id": 5,
  "movieName": "La La Land",
  "duration": "1:50:45",
  "thumbnail": "assets/HC_Images/La_la_land.jpg",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/0pdqf4P9MB8",
  "description": "La La Land is a 2016 American romantic musical comedy-drama film written and directed by Damien Chazelle. It stars Ryan Gosling and Emma Stone as a struggling jazz pianist and an aspiring actress, respectively, who meet and fall in love while pursuing their dreams in Los Angeles. John Legend, Rosemarie DeWitt, Finn Wittrock, and J. K. Simmons appear in supporting roles.",
  "rating": 1.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 313369
},{
  "_id": 6,
  "movieName": "Avatar",
  "duration": "2:42:00",
  "thumbnail": "assets/HC_Images/Avatar.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/5PSNL1qE6VY",
  "rating": 7.8,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "description": "Avatar (also marketed as James Cameron's Avatar) is a 2009 epic science fiction film directed, written, co-produced and co-edited by James Cameron, and starring Sam Worthington, Zoe Saldana, Stephen Lang, Michelle Rodriguez and Sigourney Weaver.It is set in the mid-22nd century when humans are colonizing Pandora, a lush habitable moon of a gas giant in the Alpha Centauri star system, in order to mine the valuable mineral unobtanium. The expansion of the mining colony threatens the continued existence of a local tribe of Na'vi – a humanoid species indigenous to Pandora. The film's title refers to a genetically engineered Na'vi body operated from the brain of a remotely located human that is used to interact with the natives of Pandora.",
  "tmdbId": 19995
},{
  "_id": 7,
  "movieName": "Interstellar",
  "duration": "2:49:00",
  "thumbnail": "assets/HC_Images/Interstellar.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/zSWdZVtXT7E",
  "description": "Interstellar is a 2014 epic science-fiction film co-written, directed, and produced by Christopher Nolan. It stars Matthew McConaughey, Anne Hathaway, Jessica Chastain, Bill Irwin, Ellen Burstyn, Matt Damon, and Michael Caine. Set in a dystopian future where humanity is struggling to survive, the film follows a group of astronauts who travel through a wormhole near Saturn in search of a new home for mankind.",
  "rating": 8.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 157336
},{
  "_id": 8,
  "movieName": "Joker",
  "duration": "01:58:00",
  "thumbnail": "assets/HC_Images/Joker.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/zAGVQLHvwOY",
  "description": "Joker is a 2019 American psychological thriller film directed by Todd Phillips, who also co-wrote the screenplay with Scott Silver. The film, based on DC Comics characters, stars Joaquin Phoenix as the Joker and serves as a standalone origin story for the character. Set in 1981, it follows Arthur Fleck, a failed clown and aspiring stand-up comedian whose descent into insanity and nihilism inspires a violent countercultural revolution against the wealthy in a decaying Gotham City. Robert De Niro, Zazie Beetz, and Frances Conroy appear in supporting roles. Distributed by Warner Bros. Pictures, Joker was produced by Warner Bros. Pictures and DC Films in association with Village Roadshow Pictures, Bron Creative and Joint Effort.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 475557
},{
  "_id": 9,
  "movieName": "Spider-Man: No Way Home",
  "duration": "02:28:00",
  "thumbnail": "assets/HC_Images/Spider_Man.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/JfVOs4VSpmA",
  "description": "Spider-Man: No Way Home is a 2021 American superhero film based on the Marvel Comics character Spider-Man, co-produced by Columbia Pictures and Marvel Studios and distributed by Sony Pictures Releasing. It is the sequel to Spider-Man: Homecoming (2017) and Spider-Man: Far From Home (2019), and the 27th film in the Marvel Cinematic Universe (MCU). The film was directed by Jon Watts and written by Chris McKenna and Erik Sommers. It stars Tom Holland as Peter Parker / Spider-Man alongside Zendaya, Benedict Cumberbatch, Jacob Batalon, Jon Favreau, Jamie Foxx, Willem Dafoe, Alfred Molina, Benedict Wong, Tony Revolori, Marisa Tomei, Andrew Garfield, and Tobey Maguire. In the film, Parker asks Dr. Stephen Strange (Cumberbatch) to use magic to make his identity as Spider-Man a secret again following its public revelation at the end of Far From Home. When the spell goes wrong because of Parker's actions, the multiverse is broken open, which allows visitors from alternate realities to enter Parker's universe.",
  "rating": 8.3,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 634649
},{
  "_id": 10,
  "movieName": "Inception",
  "duration": "02:28:00",
  "thumbnail": "assets/HC_Images/Inception.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/YoHD9XEInc0",
  "description": "Inception is a 2010 science fiction action film written and directed by Christopher Nolan, who also produced the film with Emma Thomas, his wife. The film stars Leonardo DiCaprio as a professional thief who steals information by infiltrating the subconscious of his targets. He is offered a chance to have his criminal history erased as payment for the implantation of another person's idea into a target's subconscious.The ensemble cast includes Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Elliot Page,Tom Hardy, Dileep Rao, Cillian Murphy, Tom Berenger, and Michael Caine.",
  "rating": 8.8,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 27205
},{
  "_id": 11,
  "movieName": "Dune",
  "duration": "02:35:00",
  "thumbnail": "assets/HC_Images/Dune.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/8g18jFHCLXk",
  "description": "Dune (titled onscreen as Dune: Part One) is a 2021 American epic science fiction film directed by Denis Villeneuve from a screenplay by Villeneuve, Jon Spaihts, and Eric Roth. It is the first part of a two-part adaptation of the 1965 novel by Frank Herbert, primarily covering the first half of the book. Set in the distant future, the film follows Paul Atreides as his family, the noble House Atreides, is thrust into a war for the deadly and inhospitable desert planet Arrakis. The ensemble cast includes Timothée Chalamet, Rebecca Ferguson, Oscar Isaac, Josh Brolin, Stellan Skarsgård, Dave Bautista, Stephen McKinley Henderson, Zendaya, David Dastmalchian, Chang Chen, Sharon Duncan-Brewster, Charlotte Rampling, Jason Momoa, and Javier Bardem.\n\n",
  "rating": 8,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 438631
},{
  "_id": 12,
  "movieName": "Raya and the Last Dragon",
  "duration": "01:54:00",
  "thumbnail": "assets/HC_Images/Raya.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/1VIZ89FEjYI",
  "description": "Raya and the Last Dragon (/ˈraɪ.ə/ RYE-ə) is a 2021 American computer-animated fantasy action-adventure film produced by Walt Disney Animation Studios and distributed by Walt Disney Studios Motion Pictures. The 59th film produced by the studio, it was directed by Don Hall and Carlos López Estrada, and produced by Osnat Shurer and Peter Del Vecho. The screenplay was written by Qui Nguyen and Adele Lim, both of whom also wrote the story with Hall, Estrada, Paul Briggs, John Ripa, Kiel Murray, and Dean Wellins, based on story ideas by Bradley Raymond and additional story contributions by Helen Kalafatic. The film is inspired by traditional Southeast Asian cultures.",
  "rating": 7.3,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 527774
},{
  "_id": 13,
  "movieName": "Spider-Man: Into the Spider-Verse",
  "duration": "01:56:00",
  "thumbnail": "assets/HC_Images/Spider_verse.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/g4Hbz2jLxvQ",
  "description": "Spider-Man: Into the Spider-Verse is a 2018 American computer-animated superhero film featuring the Marvel Comics character Miles Morales / Spider-Man, produced by Columbia Pictures and Sony Pictures Animation in association with Marvel Entertainment. Distributed by Sony Pictures Releasing, it is the first animated film in the Spider-Man franchise.[4][5] Directed by Bob Persichetti, Peter Ramsey, and Rodney Rothman (in Persichetti and Rothman's feature directorial debuts) from a screenplay by Phil Lord and Rothman, it stars Shameik Moore as Morales, alongside the voices of Jake Johnson, Hailee Steinfeld, Mahershala Ali, Brian Tyree Henry, Lily Tomlin, Luna Lauren Vélez, John Mulaney, Kimiko Glenn, Nicolas Cage, and Liev Schreiber. The film's story follows Miles Morales as he becomes the new Spider-Man and joins other Spider-People from various parallel universes to save his universe from Kingpin.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 324857
},{
  "_id": 14,
  "movieName": "The Matrix",
  "duration": "02:16:00",
  "thumbnail": "assets/HC_Images/matrix.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/9ix7TUGVYIo",
  "description": "The Matrix is a 1999 science fiction action film written and directed by the Wachowskis.[a] It is the first installment in The Matrix film series, starring Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving, and Joe Pantoliano, it depicts a dystopian future in which humanity is unknowingly trapped inside the Matrix, a simulated reality that intelligent machines have created to distract humans while using their bodies as an energy source.When computer programmer Thomas Anderson, under the hacker alias \"Neo\", uncovers the truth, he joins a rebellion against the machines along with other people who have been freed from the Matrix.",
  "rating": 8.7,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 603
},{
  "_id": 15,
  "movieName": "The Batman",
  "duration": "02:56:00",
  "thumbnail": "assets/HC_Images/batma.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/mqqft2x_Aa4",
  "description": "The Batman is a 2022 American superhero film based on the DC Comics character Batman. Produced by DC Films, 6th & Idaho, and Dylan Clark Productions, and distributed by Warner Bros. Pictures, it is a reboot of the Batman film franchise. The film was directed by Matt Reeves, who wrote the screenplay with Peter Craig. It stars Robert Pattinson as Bruce Wayne / Batman alongside Zoë Kravitz, Paul Dano, Jeffrey Wright, John Turturro, Peter Sarsgaard, Andy Serkis, and Colin Farrell. The film sees Batman, who has been fighting crime in Gotham City for two years, uncover corruption while pursuing the Riddler (Dano), a serial killer who targets Gotham's elite.",
  "rating": 7.9,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 414906
},{
  "_id": 16,
  "movieName": "Ratatouille",
  "duration": "01:51:00",
  "thumbnail": "assets/HC_Images/Ratatouille.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/NgsQ8mVkN8w",
  "description": "Ratatouille is a 2007 American computer-animated comedy-drama film produced by Pixar Animation Studios and released by Walt Disney Pictures. The eighth film produced by Pixar, it was written and directed by Brad Bird, who took over from Jan Pinkava in 2005, and produced by Brad Lewis, from an original idea by Jan Pinkava. The title refers to the French dish ratatouille, which is served at the end of the film, and also references the species of the main character, a rat. Set in Paris, the plot follows a rat who dreams of becoming a chef and tries to achieve his goal by forming an unlikely alliance with a restaurant's garbage boy.",
  "rating": 8.1,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 2062
},{
  "_id": 17,
  "movieName": "How to Train Your Dragon: The Hidden World",
  "duration": "01:44:00",
  "thumbnail": "assets/HC_Images/How to Train Your Dragon.jpg",
  "genre": "adventure",
  "sourceUrl": "https://www.youtube.com/embed/acDHTkslk2w",
  "description": "How to Train Your Dragon: The Hidden World (also known as How to Train Your Dragon 3) is a 2019 American computer-animated action fantasy film loosely based on the book series by Cressida Cowell. Produced by DreamWorks Animation and distributed by Universal Pictures, it is the sequel to How to Train Your Dragon 2 (2014) and the third and final installment in the How to Train Your Dragon trilogy. Written and directed by Dean DeBlois, the film stars the voices of Jay Baruchel, America Ferrera, Cate Blanchett, Craig Ferguson, and F. Murray Abraham. The film follows Hiccup as he seeks a dragon utopia known as \"The Hidden World\" while coming to terms with Toothless' new bond with a female Fury, as they deal with the threat of a ruthless dragon hunter named Grimmel the Grisly.",
  "rating": 7.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 166428
},{
  "_id": 18,
  "movieName": "Inside Out",
  "duration": "01:35:00",
  "thumbnail": "assets/HC_Images/inside_out.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/yRUAzGQ3nSY",
  "description": "Inside Out is a 2015 American computer-animated film directed by Pete Docter from a screenplay he co-wrote with Meg LeFauve and Josh Cooley. Produced by Pixar Animation Studios, it stars the voices of Amy Poehler, Phyllis Smith, Richard Kind, Bill Hader, Lewis Black, Mindy Kaling, Kaitlyn Dias, Diane Lane, and Kyle MacLachlan. The film follows the inner workings inside the mind of a young girl named Riley, as five personified emotions administer her thoughts and actions as she adapts to her family's relocation.",
  "rating": 8.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 150540
},{
  "_id": 19,
  "movieName": "Up",
  "duration": "01:36:00",
  "thumbnail": "assets/HC_Images/up.jpg",
  "genre": "adventure",
  "sourceUrl": "https://www.youtube.com/embed/HWEW_qTLSEE",
  "description": "Up is a 2009 American computer-animated film produced by Pixar Animation Studios and released by Walt Disney Pictures. The film was directed by Pete Docter, co-directed by Bob Peterson (in his feature directorial debut), and produced by Jonas Rivera. Docter and Peterson also wrote the film's screenplay and story, with Tom McCarthy co-writing the latter. The film stars the voices of Ed Asner, Christopher Plummer, Jordan Nagai, and Peterson. The film centers on elderly widower Carl Fredricksen and Wilderness Explorer Russell, who go on a journey to South America in order to fulfill a promise that Carl made to his late wife Ellie. Along the way, they meet a talking dog named Dug, and encounter a giant bird named Kevin, who is being hunted by the explorer Charles Muntz who is Carl's childhood idol.",
  "rating": 8.3,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 14160
},{
  "_id": 20,
  "movieName": "Frozen",
  "duration": "01:42:00",
  "thumbnail": "assets/HC_Images/frozen.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/TbQm5doF_Uc",
  "description": "Frozen is a 2013 American computer-animated musical fantasy film produced by Walt Disney Animation Studios and released by Walt Disney Pictures. The 53rd feature film produced by the studio, the film is inspired by Hans Christian Andersen's fairy tale The Snow Queen (1844). Directed by Chris Buck and Jennifer Lee, written by Buck, Lee and Shane Morris and produced by Peter Del Vecho, the film stars the voices of Kristen Bell, Idina Menzel, Josh Gad, Jonathan Groff and Santino Fontana.",
  "rating": 7.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 109445
},{
  "_id": 21,
  "movieName": "Coco",
  "duration": "01:45:00",
  "thumbnail": "assets/HC_Images/coco.jpg",
  "genre": "adventure",
  "sourceUrl": "https://www.youtube.com/embed/xlnPHQ3TLX8",
  "description": "Coco is a 2017 American computer-animated fantasy film produced by Pixar Animation Studios and released by Walt Disney Pictures. Based on an original idea by Lee Unkrich, it is directed by him and co-directed by Adrian Molina. The film's voice cast stars Anthony Gonzalez, Gael García Bernal, Benjamin Bratt, Alanna Ubach, Renée Victor, Ana Ofelia Murguía and Edward James Olmos. The story follows a 12-year-old boy named Miguel (Gonzalez) who is accidentally transported to the Land of the Dead, where he seeks the help of his deceased musician great-great-grandfather to return him to his family among the living and to reverse his family's ban on music.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 354912
},{
  "_id": 22,
  "movieName": "The Lion King",
  "duration": "01:58:00",
  "thumbnail": "assets/HC_Images/lion_king.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/7TavVZMewpY",
  "description": "The Lion King is a 2019 American musical drama film directed and produced by Jon Favreau, written by Jeff Nathanson, and produced by Walt Disney Pictures and Fairview Entertainment. It is a photorealistic computer-animated remake of Disney's traditionally animated 1994 film of the same name. The film stars the voices of Donald Glover, Seth Rogen, Chiwetel Ejiofor, Alfre Woodard, Billy Eichner, John Kani, John Oliver, Florence Kasumba, Eric André, Keegan-Michael Key, JD McCrary, Shahadi Wright Joseph, and Beyoncé Knowles-Carter, as well as James Earl Jones reprising his role from the original film. The plot follows Simba, a young lion who must embrace his role as the rightful king of his homeland following the murder of his father, Mufasa, at the hands of his uncle, Scar.",
  "rating": 6.8,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 420818
},{
  "_id": 23,
  "movieName": "WALL-E",
  "duration": "01:38:00",
  "thumbnail": "assets/HC_Images/wall-e.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/CZ1CATNbXg0",
  "description": "WALL-E (stylized with an interpunct as WALL·E) is a 2008 American computer-animated science fiction film produced by Pixar Animation Studios and released by Walt Disney Pictures. It was directed and co-written by Andrew Stanton, produced by Jim Morris, and co-written by Jim Reardon. It stars the voices of Ben Burtt, Elissa Knight, Jeff Garlin, John Ratzenberger, Kathy Najimy, with Sigourney Weaver and Fred Willard. The overall ninth feature film produced by the studio, WALL-E follows a solitary robot on a future, uninhabitable, deserted Earth in 2805, left to clean up garbage. He is visited by a probe sent by the starship Axiom, a robot called EVE, with whom he falls in love and pursues across the galaxy.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 10681
},{
  "_id": 24,
  "movieName": "Despicable Me",
  "duration": "01:35:00",
  "thumbnail": "assets/HC_Images/Despicable_Me.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/zzCZ1W_CUoI",
  "description": "Despicable Me is a computer-animated media franchise centering on Gru, a reformed super-villain (who later becomes a father, husband, and secret agent), and his yellow-colored Minions. It is produced by Illumination and distributed by its parent company Universal Pictures.",
  "rating": 7.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 20352
},{
  "_id": 25,
  "movieName": "Kung Fu Panda",
  "duration": "01:32:00",
  "thumbnail": "assets/HC_Images/Kung_Fu_Panda.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/siLm9q4WIjI",
  "description": "Kung Fu Panda is a 2008 American computer-animated martial arts comedy film produced by DreamWorks Animation and distributed by Paramount Pictures. It is the first installment in the Kung Fu Panda franchise. Directed by John Stevenson (in his feature directorial debut) and Mark Osborne, the film stars the voices of Jack Black, Dustin Hoffman, Angelina Jolie, Ian McShane, Seth Rogen, Lucy Liu, David Cross, Randall Duk Kim, James Hong, Dan Fogler, Michael Clarke Duncan, and Jackie Chan. The film is set in a version of ancient China populated by anthropomorphic animals and revolves around a bumbling panda named Po, a kung-fu enthusiast. When a notorious snow-leopard named Tai Lung is foretold to escape from prison, Po is unwittingly named the \"Dragon Warrior\" – a prophesied hero worthy of reading a scroll said to grant its reader limitless power.",
  "rating": 7.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 9502
},{
  "_id": 26,
  "movieName": "Finding Nemo",
  "duration": "01:40:00",
  "thumbnail": "assets/HC_Images/finding_nemo.jpg",
  "genre": "adventure",
  "sourceUrl": "https://www.youtube.com/embed/9oQ628Seb9w",
  "description": "Finding Nemo is a 2003 American computer-animated comedy-drama adventure film[2] produced by Pixar Animation Studios and released by Walt Disney Pictures. Directed by Andrew Stanton with co-direction by Lee Unkrich, the screenplay was written by Stanton, Bob Peterson, and David Reynolds from a story by Stanton. The film stars the voices of Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe, and Geoffrey Rush. It tells the story of an overprotective clownfish named Marlin who, along with a regal blue tang named Dory, searches for his missing son Nemo. Along the way, Marlin learns to take risks and comes to terms with Nemo taking care of himself.",
  "rating": 8.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 12
},{
  "_id": 27,
  "movieName": "Brahmastra: Part One – Shiva",
  "duration": "02:47:00",
  "thumbnail": "assets/HC_Images/Brahmastra.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/aBtnvjSb25M",
  "description": "Brahmāstra: Part One – Shiva (pronounced [bɾəɦmaːstrə]) is a 2022 Indian Hindi-language fantasy action-adventure film written and directed by Ayan Mukerji. It is produced by Karan Johar, Apoorva Mehta, Namit Malhotra, and Mukerji (in his debut production) – under the production companies Dharma Productions, Starlight Pictures, and Prime Focus in association with Star Studios, along with Ranbir Kapoor and Marijke DeSouza. The film serves as the first installment of a planned trilogy, which is itself planned to be part of a cinematic universe titled Astraverse.",
  "rating": 5.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 496331
},{
  "_id": 28,
  "movieName": "Shershaah",
  "duration": "02:15:00",
  "thumbnail": "assets/HC_Images/Shershaah.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/Q0FTXnefVBA",
  "description": "Shershaah (transl. Lion king) is a 2021 Indian Hindi-language biographical war film based on the life of Vikram Batra, martyred in Kargil War, directed by Vishnuvardhan in his Hindi film debut and written by Sandeep Shrivastava. The film was produced by Dharma Productions and Kaash Entertainment, with Hiroo Yash Johar, Karan Johar, Apoorva Mehta, Shabbir Boxwala, Ajay Shah and Himanshu Gandhi serving as producers. Sidharth Malhotra stars in dual roles as Batra and his twin brother Vishal, with Kiara Advani as his girlfriend Dimple Cheema.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 599925
},{
  "_id": 29,
  "movieName": "Super 30",
  "duration": "02:42:00",
  "thumbnail": "assets/HC_Images/Super_30.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/QpvEWVVnICE",
  "description": "Super 30 is a 2019 Indian Hindi-language biographical drama film produced by Phantom Films, Nadiadwala Grandson Entertainment, Reliance Entertainment and HRX Films at budget of ₹60 crore. Based on the life of mathematics teacher and educator Anand Kumar as well as educational program of the same title, it is directed by Vikas Bahl and stars Hrithik Roshan as Kumar.",
  "rating": 7.9,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 534075
},{
  "_id": 30,
  "movieName": "Andhadhun",
  "duration": "02:18:00",
  "thumbnail": "assets/HC_Images/Andhadhun.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/2iVYI99VGaw",
  "description": "Andhadhun (transl. Blind Tune) is a 2018 Indian Hindi-language black comedy crime thriller film co-written and directed by Sriram Raghavan. It stars Tabu, Ayushmann Khurrana, Radhika Apte and Anil Dhawan. The film tells the story of a blind piano player who unwittingly becomes embroiled in the murder of a retired actor",
  "rating": 8.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 534780
},{
  "_id": 31,
  "movieName": "Bajirao Mastani",
  "duration": "02:38:00",
  "thumbnail": "assets/HC_Images/Bajirao_Mastani.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/eHOc-4D7MjY",
  "description": "Bajirao Mastani is a 2015 Indian Hindi-language epic historical romance film directed by Sanjay Leela Bhansali, who co-produced it with Eros International and composed its soundtrack. The film stars Ranveer Singh, Deepika Padukone and Priyanka Chopra with Tanvi Azmi, Vaibhav Tatwawaadi, Milind Soman, Mahesh Manjrekar and Aditya Pancholi in supporting roles. Based on Nagnath S. Inamdar's Marathi novel Rau, Bajirao Mastani narrates the story of the Maratha Peshwa Bajirao I (1700–1740 AD) and his second wife, Mastani.",
  "rating": 7.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 362045
},{
  "_id": 32,
  "movieName": "War",
  "duration": "02:36:00",
  "thumbnail": "assets/HC_Images/war.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/tQ0mzXRk-oM",
  "description": "War is a 2019 Indian Hindi-language action thriller film directed by Siddharth Anand from a screenplay by Shridar Raghavan, Anand, and Abbas Tyrewala, and a story from and produced by Aditya Chopra for Yash Raj Films. It is the third installment in the YRF Spy Universe and stars Hrithik Roshan, Tiger Shroff, and Vaani Kapoor. In the film, Khalid Rahmani (Shroff), an Indian soldier, is assigned to eliminate his former mentor Kabir Dhaliwal (Roshan), who has inexplicably gone rogue.",
  "rating": 6.5,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 585268
},{
  "_id": 33,
  "movieName": "Dangal",
  "duration": "02:41:00",
  "thumbnail": "assets/HC_Images/Dangal.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/x_7YlGv9u1g",
  "description": "Dangal (transl. \"Wrestling Competition\") is a 2016 Indian Hindi-language biographical sports drama film directed by Nitesh Tiwari and produced by Aamir Khan and Kiran Rao under Aamir Khan Productions with Siddharth Roy Kapur under The Walt Disney Company India. The film stars Khan as Mahavir Singh Phogat, a pehlwani amateur wrestler who trains his daughters Geeta Phogat and Babita Kumari to become India's first world-class female wrestlers.Fatima Sana Shaikh and Sanya Malhotra portray the adult versions of the two Phogat sisters, Zaira Wasim and Suhani Bhatnagar their younger versions, Sakshi Tanwar their mother, and Aparshakti Khurana adult version of their cousin, Ritvik Sahore his younger version, all of them except Tanwar and Sahore in their film debuts.",
  "rating": 8.3,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 360814
},{
  "_id": 34,
  "movieName": "PK",
  "duration": "02:32:00",
  "thumbnail": "assets/HC_Images/pk.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/SOXWc32k4zA",
  "description": "PK (transl. Tipsy) is a 2014 Indian Hindi-language satirical comedy drama film edited and directed by Rajkumar Hirani and written by Hirani and Abhijat Joshi, and jointly produced by Hirani and Vidhu Vinod Chopra under the banners Rajkumar Hirani Films and Vinod Chopra Films respectively. After the success of 3 Idiots (2009), Hirani and Joshi began scripting their next project; finding similarities with the plot of Inception (2010), they scrapped the film. It was later rewritten with a different angle and tone. During production, the film was initially titled Talli and later Ek Tha Talli before being changed to PK as the latter title was found to be too similar to Ek Tha Tiger (2012). The film's soundtrack was composed by Shantanu Moitra, Ajay–Atul and Ankit Tiwari with lyrics written by Swanand Kirkire, Amitabh Varma and Manoj Muntashir. UTV Motion Pictures acquired the distribution rights of the film. PK was the first Bollywood film to be shot in Belgium.",
  "rating": 8.1,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 297222
},{
  "_id": 35,
  "movieName": "RRR",
  "duration": "03:02:00",
  "thumbnail": "assets/HC_Images/RRR.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/NgBoMJy386M",
  "description": "RRR is a 2022 Indian Telugu-language epic action drama film directed by S. S. Rajamouli, who co-wrote the film with V. Vijayendra Prasad. It was produced by D. V. V. Danayya of DVV Entertainment. The film stars N. T. Rama Rao Jr., Ram Charan, Ajay Devgn, Alia Bhatt, Shriya Saran, Samuthirakani, Ray Stevenson, Alison Doody, and Olivia Morris. It centers around two real-life Indian revolutionaries, Alluri Sitarama Raju (Charan) and Komaram Bheem (Rama Rao), their friendship and their fight against the British Raj. Set in the 1920s, the plot explores the undocumented period in their lives when both the revolutionaries chose to go into obscurity before they began the fight for their country.",
  "rating": 8,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 579974
},{
  "_id": 36,
  "movieName": "Pushpa: The Rise",
  "duration": "02:30:00",
  "thumbnail": "assets/HC_Images/pushpa.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/Q1NKMPhP8PY",
  "description": "Pushpa: The Rise – Part 01 is a 2021 Indian Telugu-language action drama film written and directed by Sukumar. It stars Allu Arjun as the titular character alongside Fahadh Faasil (his Telugu debut), and Rashmika Mandanna while Jagadeesh Prathap Bandari, Sunil, Rao Ramesh, Dhananjaya, Anasuya Bharadwaj, Ajay and Ajay Ghosh play supporting roles. It is produced by Mythri Movie Makers in association with Muttamsetty Media. The first of two cinematic parts, the film depicts the rise of a low wage laborer in the smuggling syndicate of red sandalwood, a rare wood that grows only in the Seshachalam Hills of Andhra Pradesh state.",
  "rating": 7.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 690957
},{
  "_id": 37,
  "movieName": "Radhe Shyam",
  "duration": "02:18:00",
  "thumbnail": "assets/HC_Images/Radhe+Shyam.jpg",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/ZAP6q_Zv-4g",
  "description": "Radhe Shyam is a 2022 Indian period romantic drama film written and directed by Radha Krishna Kumar. The film is produced by UV Creations and T-Series, and was shot simultaneously in Telugu and Hindi languages. It stars Prabhas and Pooja Hegde in lead roles with Bhagyashree, Kunaal Roy Kapur, Sathyaraj, Krishnam Raju, Sachin Khedekar, Priyadarshi Pulikonda, Murali Sharma and Jayaram in Supporting roles. The film's story is set in Italy of 1970s, and the film tells the story of Vikramaditya, a palmist, who is conflicted between destiny and his love for Prerana.",
  "rating": 5.3,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 673392
},{
  "_id": 38,
  "movieName": "Hit",
  "duration": "02:18:00",
  "thumbnail": "assets/HC_Images/hit.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/uYdsWe9iBAA",
  "description": "HIT: The First Case is a 2020 Indian Telugu-language action thriller film directed by debutant Sailesh Kolanu and produced by Prashanti Tipirneni. The first installment in The HIT Verse, it stars Vishwak Sen and Ruhani Sharma. The plot follows Vikram Rudraraju, a police officer of the Telangana state's Homicide Intervention Team (HIT) who is tasked with investigating the missing case of a young girl.",
  "rating": 7.6,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 678391
},{
  "_id": 39,
  "movieName": "Rangasthalam",
  "duration": "02:53:00",
  "thumbnail": "assets/HC_Images/Rangasthalam.jpg",
  "genre": "comedy",
  "sourceUrl": "https://www.youtube.com/embed/sueMmTm-M4Y",
  "description": "Rangasthalam (transl. 'Theatre') is a 2018 Indian Telugu-language period action drama film written and directed by Sukumar. Produced by Y. Naveen, Y. Ravi Shankar and C. V. Mohan for the company Mythri Movie Makers, the film stars Ram Charan and Samantha Akkineni with Aadhi Pinisetty, Jagapathi Babu, Prakash Raj, Naresh, and Anasuya Bharadwaj in key supporting roles. Rangasthalam is set in the eponymous fictional village in the 1980s. It narrates the story of two brothers, Chittibabu (Charan) and Kumar Babu (Pinisetty) who oppose the village's local government and the corrupt co-operative society led by its president Phanindra Bhupathi (Babu).",
  "rating": 8.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 461126
},{
  "_id": 40,
  "movieName": "Baahubali: The Beginning",
  "duration": "02:38:00",
  "thumbnail": "assets/HC_Images/Baahubali.jpg",
  "genre": "adventure",
  "sourceUrl": "https://www.youtube.com/embed/sOEg_YZQsTI",
  "description": "Baahubali: The Beginning is a 2015 Indian epic action film co-written and directed by S. S. Rajamouli, and produced by Shobu Yarlagadda and Prasad Devineni under Arka Media Works. The film was filmed in both Telugu and Tamil languages simultaneously. The film features an ensemble cast including Prabhas as triple role double leads roles and single photographs role alongside, Rana Daggubati, Anushka Shetty, Tamannaah, Ramya Krishna, Sathyaraj, and Nassar. The first of two cinematic parts, the film follows Sivudu, an adventurous young man who helps his love Avantika rescue Devasena, the former queen of Mahishmati who is now a prisoner under the tyrannical rule of king Bhallaladeva. The story concludes in Baahubali 2: The Conclusion.",
  "rating": 8,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 256040
},{
  "_id": 41,
  "movieName": "Saaho",
  "duration": "02:38:00",
  "thumbnail": "assets/HC_Images/saaho.jpg",
  "genre": "thriller",
  "sourceUrl": "https://www.youtube.com/embed/lD0-ztCFydA",
  "description": "Saaho (transl. Let victory be yours) is a 2019 Indian action film written and directed by Sujeeth, and produced by UV Creations. It stars Prabhas in titular role, leading an ensemble cast including Shraddha Kapoor, Chunky Pandey, Jackie Shroff, Arun Vijay, Neil Nitin Mukesh, Lal, Murali Sharma, Mandira Bedi, Mahesh Manjrekar, Prakash Belawadi, Tinnu Anand, Evelyn Sharma, Supreeth, Devan, and Vennela Kishore. Saaho marks the Hindi film debut of Prabhas and the Telugu film debut of Shraddha Kapoor. The film follows two covert operatives who are on the hunt for a thief who has stolen ₹2000 crore (US$284 million).[a] Soon, they realise that the case is linked to the death of a businessman and an emerging gang war.",
  "rating": 5,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 454292
},{
  "_id": 42,
  "movieName": "2.0",
  "duration": "02:27:00",
  "thumbnail": "assets/HC_Images/2.0.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/_qOl_7qfPOM",
  "description": "2.0 is a 2018 Indian Tamil-language science fiction action film directed by S. Shankar who co-wrote the film with B. Jeyamohan and Madhan Karky. Produced by Subaskaran under the banner of Lyca Productions. As the second instalment in the Enthiran franchise, 2.0 is a standalone sequel to Enthiran (2010), featuring Rajinikanth reprising the roles of Vaseegaran and Chitti the Robot, alongside Akshay Kumar as Pakshi Rajan and Amy Jackson as Nila. also Sudhanshu Pandey, Adil Hussain, Kalabhavan Shajohn, and K. Ganesh appear in supporting roles. The soundtrack is composed by A. R. Rahman, with lyrics written by Madhan Karky and Na. Muthukumar. The film follows the conflict between Chitti, the once dismantled humanoid robot, and Pakshi Rajan, a former ornithologist who seeks vengeance upon cell phone users to prevent avian population decline.",
  "rating": 6.1,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 373449
},{
  "_id": 43,
  "movieName": "K.G.F: Chapter 2",
  "duration": "02:48:00",
  "thumbnail": "assets/HC_Images/KGF.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/bDTUFufX-1s",
  "description": "K.G.F: Chapter 2 is a 2022 Indian Kannada-language period action film written and directed by Prashanth Neel, and produced by Vijay Kiragandur under the banner Hombale Films. The second installment in a two-part series, it serves as a sequel to the 2018 film K.G.F: Chapter 1. The film stars Yash, Sanjay Dutt, Raveena Tandon, Srinidhi Shetty and Prakash Raj. It follows the assassin Rocky who after establishing himself as the kingpin of the Kolar Gold Fields, must retain his supremacy over adversaries and government officials, while also coming to terms with his past.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 587412
},{
  "_id": 44,
  "movieName": "Vikram",
  "duration": "02:53:00",
  "thumbnail": "assets/HC_Images/Vikram.jpg",
  "genre": "action",
  "sourceUrl": "https://www.youtube.com/embed/OKBMCL-frPU",
  "description": "Vikram is a 2022 Indian Tamil-language action thriller film written and directed by Lokesh Kanagaraj and produced by Raaj Kamal Films International. The film stars Kamal Haasan, Vijay Sethupathi and Fahadh Faasil.Kalidas Jayaram, Narain and Chemban Vinod Jose play supporting roles while Suriya makes a cameo appearance. The film's soundtrack and score are composed by Anirudh Ravichander, with cinematography handled by Girish Gangadharan and editing done by Philomin Raj. The film serves as the second installment in the Lokesh Cinematic Universe (LCU).The plot follows a black-ops squad led by Agent Vikram, in which he aims to bring down a drug syndicate group called Vetti Vagaiyara, led by Sandhanam, who wants the missing drugs to be delivered to his boss Rolex.",
  "rating": 8.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 743563
},{
  "_id": 45,
  "movieName": "Ala Vaikunthapurramuloo",
  "duration": "02:45:00",
  "thumbnail": "assets/HC_Images/Ala_Vaikunthapurramuloo.jpg",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/SkENAjfVoNI",
  "description": "Ala Vaikunthapurramuloo , also known by the initialism AVPL, is a 2020 Indian Telugu-language action drama film written and directed by Trivikram Srinivas. The film stars Allu Arjun and Pooja Hegde, alongside Tabu, Jayaram, Sushanth, and Nivetha Pethuraj. Samuthirakani, Murali Sharma, Navdeep, Sunil, Sachin Khedekar, Harsha Vardhan, and Rajendra Prasad play other supporting roles. It is produced by Allu Aravind and S. Radha Krishna under their banners Geetha Arts and Haarika & Hassine Creations respectively.",
  "rating": 7.3,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 628241
},{
  "_id": 46,
  "movieName": "Oh! Baby",
  "duration": "02:41:00",
  "thumbnail": "assets/HC_Images/oh_baby.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/D4x6CeRV5Bc",
  "description": "Oh! Baby is a 2019 Indian Telugu-language fantasy comedy film directed by B. V. Nandini Reddy. The film stars Samantha Akkineni and Lakshmi. A remake of the 2014 South Korean film Miss Granny, the plot follows a woman in her 70s (Lakshmi) who magically finds herself in the body of her 24-year-old self (Samantha) after having her picture taken at a mysterious photo studio. Naga Shaurya, Rajendra Prasad, Rao Ramesh, and Sajja Teja play supporting roles. The music was composed by Mickey J. Meyer.",
  "rating": 7.4,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 607091
},{
  "_id": 47,
  "movieName": "Adipurush",
  "duration": "02:29:00",
  "thumbnail": "assets/HC_Images/Adipurush.jpg",
  "genre": "SciFi",
  "sourceUrl": "https://www.youtube.com/embed/jF5rJAXUY4A",
  "description": "Adipurush  is an upcoming Indian epic mythological film based on Ramayana. The film is written and directed by Om Raut and produced by T-Series and Retrophiles starring Lottery Star Prabhas, Kriti Sanon, Saif Ali Khan, Sunny Singh and Devdatta Nage.",
  "rating": 8.5,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 734253
},{
  "_id": 48,
  "movieName": "Eega",
  "duration": "02:25:00",
  "thumbnail": "assets/HC_Images/Eega.jpg",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/x-1ZoU1xB4I",
  "description": "Eega (transl. The Fly) is a 2012 Indian Telugu-language fantasy action film written and directed by S. S. Rajamouli. The film was produced by Sai Korrapati's Vaaraahi Chalana Chitram with an estimated budget of ₹30–40 crore (US$6–7 million).[c][d] It was simultaneously filmed in Tamil language with the title Naan Ee (transl. I, the Fly). The film stars Sudeepa, Nani, and Samantha. M. M. Keeravani composed the songs and the background score while K. K. Senthil Kumar was the director of photography. Janardhana Maharshi and Crazy Mohan wrote the dialogue for the Telugu and Tamil versions, respectively.",
  "rating": 7.7,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 148265
},{
  "_id": 49,
  "movieName": "Yeh Jawaani Hai Deewani",
  "duration": "02:40:00",
  "thumbnail": "assets/HC_Images/Yeh_Jawaani_Hai_Deewani.jpg",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/Rbp2XUSeUNE",
  "description": "Yeh Jawaani Hai Deewani (transl. This youth is crazy), also abbreviated as YJHD, is a 2013 Indian Hindi-language coming-of-age romantic comedy-drama film directed by Ayan Mukerji, written by Mukerji and Hussain Dalal, and produced by Karan Johar. It stars Deepika Padukone and Ranbir Kapoor[6] in their second film together after Bachna Ae Haseeno (2008), with Kalki Koechlin and Aditya Roy Kapur in pivotal supporting roles. The story revolves around Naina Talwar and Kabir Thapar who meet during a trekking trip where she falls in love with him but refrains from expressing it. They soon drift apart but end up meeting at a friend's wedding.",
  "rating": 7.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 185008
},{
  "_id": 50,
  "movieName": "Vaaranam Aayiram",
  "duration": "02:43:00",
  "thumbnail": "assets/HC_Images/Vaaranam_Aayiram.jpg",
  "genre": "romantic",
  "sourceUrl": "https://www.youtube.com/embed/GkPKKI39u9o",
  "description": "Vaaranam Aayiram (transl. Thousand Elephants) is a 2008 Indian Tamil-language action drama film written and directed by Gautham Vasudev Menon and produced by Venu Ravichandran of Aascar Films. The film stars Suriya in dual lead roles as father and son, with Sameera Reddy, Simran and Divya Spandana in lead roles, the latter in her Tamil debut. The film features music composed by Harris Jayaraj, making Vaaranam Aayiram his final project with Menon before the formal break-up of their partnership, until they worked together again in Yennai Arindhaal (2015). Cinematography for the film has been handled by R. Rathnavelu and editing done by Anthony Gonsalvez.",
  "rating": 8.2,
  "_class": "com.niit.Movie_Service.domain.Movie",
  "tmdbId": 38637
}]